# Q1: What is a database? Differentiate between SQL and NoSQL databases.

## A1. 
A database is a structured collection of data that is organized and stored in a way that allows efficient retrieval, updating, and management of that data. Databases are used to store and manage large volumes of data in a systematic and organized manner.

**SQL (Structured Query Language) Databases:**
1. **Structure:** SQL databases are relational databases, which means they use a predefined schema to define the structure of data. Data is organized into tables with rows and columns.
2. **Data Consistency:** SQL databases follow ACID (Atomicity, Consistency, Isolation, Durability) properties, ensuring data consistency and integrity.
3. **Scalability:** Scaling SQL databases can be challenging, especially when dealing with massive amounts of data and high traffic. Vertical scaling (adding more resources to a single server) is the common approach.
4. **Examples:** MySQL, PostgreSQL, Oracle, SQL Server.

**NoSQL (Not Only SQL) Databases:**
1. **Structure:** NoSQL databases are non-relational databases that can store structured, semi-structured, or unstructured data. They do not require a fixed schema, allowing flexibility in data storage.
2. **Data Consistency:** NoSQL databases may not always guarantee ACID properties. They often prioritize performance and scalability over strict consistency.
3. **Scalability:** NoSQL databases are designed for horizontal scalability, making it easier to handle large datasets and traffic by adding more servers or nodes to a cluster.
4. **Examples:** MongoDB, Cassandra, Redis, Couchbase.

**Key Differences:**
- **Data Model:** SQL databases use a tabular, structured data model, while NoSQL databases can use various data models such as document, key-value, column-family, or graph.
- **Schema:** SQL databases have a fixed schema with predefined table structures, while NoSQL databases are schema-less or have a flexible schema.
- **Query Language:** SQL databases use SQL for querying and manipulating data, while NoSQL databases have their own query languages or APIs.
- **Consistency:** SQL databases prioritize data consistency, while NoSQL databases may prioritize availability and partition tolerance (CAP theorem).
- **Scalability:** SQL databases are traditionally scaled vertically, whereas NoSQL databases are designed for horizontal scalability.
- **Use Cases:** SQL databases are typically used for applications with well-defined data structures and complex queries, while NoSQL databases are suitable for applications with rapidly changing data or high scalability requirements.

# Note: Importing some modules, creating and connecting to a database to give examples for below questions

In [24]:
import pandas as pd

import sqlite3 as sl

In [8]:
conn = sl.connect('mydatabase.db')

In [9]:
cur = conn.cursor()

# Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.
## A2.


In the context of SQL databases, DDL stands for "Data Definition Language." DDL is a subset of SQL used for defining and managing the structure and schema of a database. It includes SQL statements like CREATE, DROP, ALTER, and TRUNCATE, which are used to perform various tasks related to database schema management.

Let's go through each of these DDL statements with examples:

1. **CREATE:** The CREATE statement is used to create new database objects, such as tables, indexes, or views.

In [10]:

# example of CREATE
# imported some modules already above
# Connect to a new database (it will be created if it doesn't exist)

cur.execute('''CREATE TABLE IF NOT EXISTS users (
                   id INTEGER PRIMARY KEY,
                   name TEXT,
                   email TEXT)''')

# Execute a SELECT query to retrieve data from the "users" table
cur.execute("SELECT * FROM users")

# Fetch all the data
rows = cur.fetchall()

# Create a DataFrame from the rows
df = pd.DataFrame(rows, columns=["ID", "Name", "Email"])

# Display the DataFrame
df

Empty DataFrame
Columns: [ID, Name, Email]
Index: []

2. **DROP:** The DROP statement is used to delete database objects like tables, indexes, or views. It permanently removes the object from the database.

In [11]:
# example of DROP
# Execute the SQL statement to drop the table
cur.execute("DROP TABLE IF EXISTS users")

# Execute a SELECT query to retrieve data from the "users" table
cur.execute("SELECT * FROM users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email"])
df
# no such table should be the output

OperationalError: no such table: users

#### note: now no table named `users` exists bcz we DROP TABLE so we're creating it again`new_users` for other examples

In [ ]:
cur.execute('''CREATE TABLE IF NOT EXISTS new_users (
                   id INTEGER PRIMARY KEY,
                   name TEXT,
                   email TEXT)''')

cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email"])
df

3. **ALTER:** The ALTER statement is used to modify the structure of an existing database object. It can be used to add, modify, or delete columns in a table, among other changes.

In [ ]:
# example of ALTER TABLE

cur.execute("ALTER TABLE new_users ADD COLUMN age INTEGER")
cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email","Age"])
df

4. **TRUNCATE:** The TRUNCATE statement is used to remove all data from a table while keeping the table structure intact. It is faster than DELETE for removing all rows.

#### note : to describe the TRUNCATE we must have some data so let's INSERT some data in `new_users` table

In [ ]:

sql = 'INSERT OR IGNORE INTO new_users (id, name, email, age) VALUES (?, ?, ?, ?)'

# Data to be inserted
data = [
    (1, 'Sumit', 'sumit@email.com', 28),
    (2, 'Bob', 'bob@email.com', 29),
    (3, 'Kris', 'kris@email.com', 30)
]
# Execute the INSERT statement for each set of data
cur.executemany(sql, data)

In [ ]:
cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email","Age"])
df

#### note : we're using `DELETE FROM` here for sqlite but `TRUNCATE TABLE` we can use in MySQL both do the same keep the structure but delete all data from rows

In [12]:
# example of TRUNCATE OR DELETE FROM

cur.execute("DELETE FROM new_users")

OperationalError: no such table: new_users

#### Now we have structure of table but no data

In [ ]:

cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email","Age"])
df

In [31]:
# Commit the changes
conn.commit()

# Close the connection
conn.close()

# Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.
## A3.

**DML (Data Manipulation Language)** is a subset of SQL (Structured Query Language) used for managing and manipulating data stored in relational databases. DML includes three fundamental operations: INSERT, UPDATE, and DELETE, which are used to add, modify, and remove data from database tables, respectively. Let's explain each of these operations with examples:

In [32]:
conn = sl.connect('mydatabase.db')
cur = conn.cursor()

In [14]:
cur.execute('''CREATE TABLE IF NOT EXISTS new_users (
                   id INTEGER PRIMARY KEY,
                   name TEXT,
                   email TEXT,
                   age INTEGER)''')

1. **INSERT:**
   - **Purpose:** The INSERT statement is used to add new rows (records) into a database table.

In [33]:
sql = 'INSERT OR IGNORE INTO new_users (id, name, email, age) VALUES (?, ?, ?, ?)'


data = [
    (1, 'Sumit', 'sumit@email.com', 28),
    (2, 'Bob', 'bob@email.com', 29),
    (3, 'Kris', 'kris@email.com', 30)
]

cur.executemany(sql, data)

In [16]:
cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email","Age"])
df

   ID   Name            Email  Age
0   1  Sumit  sumit@email.com   28
1   2    Bob    bob@email.com   29
2   3   Kris   kris@email.com   30

2. **UPDATE:**
   - **Purpose:** The UPDATE statement is used to modify existing data in a database table.

In [36]:
new_age = 31
user_id = 2
cur.execute("UPDATE new_users SET age = ? WHERE id = ?", (new_age, user_id))

In [46]:
cur.execute("SELECT * FROM new_users")
rows = cur.fetchall()
df = pd.DataFrame(rows, columns=["ID", "Name", "Email","Age"])
df

   ID   Name            Email  Age
0   1  Sumit  sumit@email.com   28
1   3   Kris   kris@email.com   30

3. **DELETE:**
   - **Purpose:** The DELETE statement is used to remove rows from a database table based on specified conditions.

In [43]:
user_id = 2
cur.execute("DELETE FROM new_users WHERE id = ?", (user_id,))

# Q4. What is DQL? Explain SELECT with an example.
## A4.
**DQL (Data Query Language)** is a subset of SQL (Structured Query Language) used for querying and retrieving data from a relational database. The primary DQL statement is the SELECT statement, which allows you to specify the data you want to retrieve and the conditions for retrieval. Let's explain the SELECT statement with an example:

**SELECT Statement:**
- **Purpose:** The SELECT statement is used to retrieve data from one or more tables in a relational database.

In [47]:
df

   ID   Name            Email  Age
0   1  Sumit  sumit@email.com   28
1   3   Kris   kris@email.com   30

In [48]:

cur.execute("SELECT * FROM new_users WHERE age<=30")
rows = cur.fetchall()
# Process and display the data
for row in rows:
    print(row)

(1, 'Sumit', 'sumit@email.com', 28)
(3, 'Kris', 'kris@email.com', 30)

# Q5. Explain Primary Key and Foreign Key.
## A5. 
**Primary Key and Foreign Key** are two fundamental concepts in relational databases, which are used to establish relationships between tables and ensure data integrity. Let's explain each of them:

**Primary Key:**

1. **Definition:** A primary key is a column or a set of columns in a relational database table that uniquely identifies each row (record) in that table. It enforces the entity integrity constraint, ensuring that each row in the table is unique.

2. **Uniqueness:** Every value in a primary key column must be unique within the table. This means that no two rows can have the same primary key value.

3. **Non-null:** A primary key column cannot contain NULL values because NULL values are not considered unique.

4. **Example:** Consider a table called "Students" with a primary key column "student_id." Each student_id value should be unique, and it cannot be NULL. This ensures that each student is uniquely identified in the table.

**Foreign Key:**

1. **Definition:** A foreign key is a column or a set of columns in a relational database table that establishes a link between data in two tables. It enforces referential integrity, ensuring that relationships between tables are maintained.

2. **References:** A foreign key in one table refers to the primary key in another table. This establishes a relationship between the two tables.

3. **Purpose:** Foreign keys are used to maintain data consistency and enforce rules like cascading deletes or updates. They ensure that data in related tables remains synchronized.

4. **Example:** Suppose you have two tables, "Orders" and "Customers." The "Orders" table may have a foreign key column "customer_id" that references the primary key "customer_id" in the "Customers" table. This foreign key relationship links each order to a specific customer.

**Key Differences:**

- **Uniqueness:** A primary key enforces uniqueness within its own table, while a foreign key establishes a relationship between tables.
- **Null Values:** A primary key column cannot contain NULL values, whereas a foreign key column can have NULL values to represent optional relationships.
- **Purpose:** Primary keys uniquely identify rows within a table, while foreign keys establish relationships between tables.
- **Usage:** Primary keys are used for data retrieval and integrity within a single table, while foreign keys are used to create relationships and maintain data integrity between multiple tables.

# Q6.Write a python code to connect MySQL to python. Explain the cursor() and execute() method.
## A6.
### note : I had practiced MySQL in `pw labs` so this may not work but it is the code to coneect MySQL database in Python

In [ ]:
!pip install mysql-connector-python

import mysql.connector

# Database connection configuration
db_config = {
    "host": "localhost",     # Replace with actual MySQL host
    "user": "abc",           # Replace with actual MySQL username
    "password": "password",  # Replace with actual MySQL password
    "database": "mydatabase" # Replace with actual MySQL database name
}

# Create a MySQL database connection
try:
    connection = mysql.connector.connect(**db_config)
    print("Connected to MySQL!")

    # Create a cursor object
    cursor = connection.cursor()

    # Execute SQL queries using the cursor
    cursor.execute("SELECT * FROM mytable")
    result = cursor.fetchall()  # Fetch all rows from the query result

    for row in result:
        print(row)

    # Close the cursor and connection
    cursor.close()
    connection.close()
    print("MySQL connection closed.")

except mysql.connector.Error as err:
    print("Error:", err)

# Q7. Give the order of execution of SQL clauses in an SQL query.
## A7. 
In an SQL query, the clauses are typically executed in a specific order, and this order is defined by the SQL standard. The order of execution of SQL clauses is as follows:

1. **FROM:** The `FROM` clause specifies the tables or data sources from which the data will be retrieved. It identifies the source of the data to be queried.

2. **WHERE:** The `WHERE` clause is used to filter the rows from the tables specified in the `FROM` clause. It defines the conditions that must be met for a row to be included in the result set.

3. **GROUP BY:** The `GROUP BY` clause is used to group rows that have the same values in specified columns into summary rows, often for use with aggregate functions like SUM, COUNT, AVG, etc.

4. **HAVING:** The `HAVING` clause is used to filter the groups generated by the `GROUP BY` clause. It specifies conditions that must be met for a group to be included in the result set.

5. **SELECT:** The `SELECT` clause specifies which columns or expressions should be included in the result set. It operates on the rows that pass the `WHERE` and `HAVING` conditions and the grouped data from the `GROUP BY` clause.

6. **DISTINCT:** The `DISTINCT` keyword is used to eliminate duplicate rows from the result set, so only unique rows are returned.

7. **ORDER BY:** The `ORDER BY` clause is used to sort the result set based on one or more columns in ascending or descending order.

8. **LIMIT/OFFSET:** The `LIMIT` and `OFFSET` clauses are used for pagination and controlling the number of rows returned. They specify how many rows should be returned and at which position to start.

9. **UNION/INTERSECT/EXCEPT:** If multiple SQL queries are combined using `UNION`, `INTERSECT`, or `EXCEPT`, the results of these operations are computed after the individual query processing.

In [ ]:
# Commit the changes
conn.commit()

# Close the connection
conn.close()